IDENTIFICATION DIVISION.
PROGRAM-ID. Hello-World.
DATE-WRITTEN. 15-07-2008.
AUTHOR. Hugh Conway.
*
PROCEDURE DIVISION.
display "Hello, World!"
stop run
.
