000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. HELLOWORLD.
000030 DATE-WRITTEN. 10/08/04 00:04.
000040 AUTHOR. UNKNOWN AUTHOR.
000050
000100 ENVIRONMENT DIVISION.
000200 CONFIGURATION SECTION.
000210 SOURCE-COMPUTER. MAINFRAME.
000220 OBJECT-COMPUTER. MAINFRAME.
000230
000300 DATA DIVISION.
000310 WORKING-STORAGE SECTION.
000320 01  TEKST PIC X(12)
000330     VALUE "HELLO, WORLD".
000410
000500 PROCEDURE DIVISION.
000600 MAIN-LOGIC SECTION.
000700 MAIN-LOGIC-BEGIN.
000710     DISPLAY TEKST.
000600 MAIN-LOGIC-END.
000700     STOP RUN.
